#!/usr/bin/env pytho
# _*_ coding:utf-8 _*_

################
#python脚本的核心是关键字，变量，流程控制与编程思想；
################
print '''''
pyto脚本的核心是关键字，变量，流程控制与编程思想。
变量也有三要素：变量名称，变量数据类型，变量操作方法（操作符，操作函数）。

python数据类型，按照特征可以划分为4个大类：数字类型，序列（数组）类型，映像类型，集合类型。
    数字类型
        整型
            布尔型
            标准整形
            长整型
        非整型
            双精度浮点型
            复数    
            decima（不是内建类型
    序列类（shell中叫数组）
        字符串 str
        元祖 tuple
        列表 list
    映像类型
        字典 dict
    集合类型
        可变集合 set
        不可变集合 frozenset

python数据类型，安装可变性（是否可变）划分，可以划分为2大类，7小类。
    可哈希的，不可变的数据类型
        数字类型
        不可变集合 frozenset
        字符串 str
        元祖 tuple
    可变的数据类型
        字典 dict
        列表 list
        可变集合 set
```        
